MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamha1g/thirdparty/atsamha1g/component/tcc.h
#define TCC_PATTB_PGEB0_Pos                   _UINT16_(0)                                          /* (TCC_PATTB) Pattern Generator 0 Output Enable Buffer Position */
#define TCC_PATTB_PGEB0_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGEB0_Pos)               /* (TCC_PATTB) Pattern Generator 0 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB0(value)                (TCC_PATTB_PGEB0_Msk & (_UINT16_(value) << TCC_PATTB_PGEB0_Pos)) /* Assigment of value for PGEB0 in the TCC_PATTB register */
#define TCC_PATTB_PGEB1_Pos                   _UINT16_(1)                                          /* (TCC_PATTB) Pattern Generator 1 Output Enable Buffer Position */
#define TCC_PATTB_PGEB1_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGEB1_Pos)               /* (TCC_PATTB) Pattern Generator 1 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB1(value)                (TCC_PATTB_PGEB1_Msk & (_UINT16_(value) << TCC_PATTB_PGEB1_Pos)) /* Assigment of value for PGEB1 in the TCC_PATTB register */
#define TCC_PATTB_PGEB2_Pos                   _UINT16_(2)                                          /* (TCC_PATTB) Pattern Generator 2 Output Enable Buffer Position */
#define TCC_PATTB_PGEB2_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGEB2_Pos)               /* (TCC_PATTB) Pattern Generator 2 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB2(value)                (TCC_PATTB_PGEB2_Msk & (_UINT16_(value) << TCC_PATTB_PGEB2_Pos)) /* Assigment of value for PGEB2 in the TCC_PATTB register */
#define TCC_PATTB_PGEB3_Pos                   _UINT16_(3)                                          /* (TCC_PATTB) Pattern Generator 3 Output Enable Buffer Position */
#define TCC_PATTB_PGEB3_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGEB3_Pos)               /* (TCC_PATTB) Pattern Generator 3 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB3(value)                (TCC_PATTB_PGEB3_Msk & (_UINT16_(value) << TCC_PATTB_PGEB3_Pos)) /* Assigment of value for PGEB3 in the TCC_PATTB register */
#define TCC_PATTB_PGEB4_Pos                   _UINT16_(4)                                          /* (TCC_PATTB) Pattern Generator 4 Output Enable Buffer Position */
#define TCC_PATTB_PGEB4_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGEB4_Pos)               /* (TCC_PATTB) Pattern Generator 4 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB4(value)                (TCC_PATTB_PGEB4_Msk & (_UINT16_(value) << TCC_PATTB_PGEB4_Pos)) /* Assigment of value for PGEB4 in the TCC_PATTB register */
#define TCC_PATTB_PGEB5_Pos                   _UINT16_(5)                                          /* (TCC_PATTB) Pattern Generator 5 Output Enable Buffer Position */
#define TCC_PATTB_PGEB5_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGEB5_Pos)               /* (TCC_PATTB) Pattern Generator 5 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB5(value)                (TCC_PATTB_PGEB5_Msk & (_UINT16_(value) << TCC_PATTB_PGEB5_Pos)) /* Assigment of value for PGEB5 in the TCC_PATTB register */
#define TCC_PATTB_PGEB6_Pos                   _UINT16_(6)                                          /* (TCC_PATTB) Pattern Generator 6 Output Enable Buffer Position */
#define TCC_PATTB_PGEB6_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGEB6_Pos)               /* (TCC_PATTB) Pattern Generator 6 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB6(value)                (TCC_PATTB_PGEB6_Msk & (_UINT16_(value) << TCC_PATTB_PGEB6_Pos)) /* Assigment of value for PGEB6 in the TCC_PATTB register */
#define TCC_PATTB_PGEB7_Pos                   _UINT16_(7)                                          /* (TCC_PATTB) Pattern Generator 7 Output Enable Buffer Position */
#define TCC_PATTB_PGEB7_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGEB7_Pos)               /* (TCC_PATTB) Pattern Generator 7 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB7(value)                (TCC_PATTB_PGEB7_Msk & (_UINT16_(value) << TCC_PATTB_PGEB7_Pos)) /* Assigment of value for PGEB7 in the TCC_PATTB register */
#define TCC_PATTB_PGVB0_Pos                   _UINT16_(8)                                          /* (TCC_PATTB) Pattern Generator 0 Output Enable Position */
#define TCC_PATTB_PGVB0_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGVB0_Pos)               /* (TCC_PATTB) Pattern Generator 0 Output Enable Mask */
#define TCC_PATTB_PGVB0(value)                (TCC_PATTB_PGVB0_Msk & (_UINT16_(value) << TCC_PATTB_PGVB0_Pos)) /* Assigment of value for PGVB0 in the TCC_PATTB register */
#define TCC_PATTB_PGVB1_Pos                   _UINT16_(9)                                          /* (TCC_PATTB) Pattern Generator 1 Output Enable Position */
#define TCC_PATTB_PGVB1_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGVB1_Pos)               /* (TCC_PATTB) Pattern Generator 1 Output Enable Mask */
#define TCC_PATTB_PGVB1(value)                (TCC_PATTB_PGVB1_Msk & (_UINT16_(value) << TCC_PATTB_PGVB1_Pos)) /* Assigment of value for PGVB1 in the TCC_PATTB register */
#define TCC_PATTB_PGVB2_Pos                   _UINT16_(10)                                         /* (TCC_PATTB) Pattern Generator 2 Output Enable Position */
#define TCC_PATTB_PGVB2_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGVB2_Pos)               /* (TCC_PATTB) Pattern Generator 2 Output Enable Mask */
#define TCC_PATTB_PGVB2(value)                (TCC_PATTB_PGVB2_Msk & (_UINT16_(value) << TCC_PATTB_PGVB2_Pos)) /* Assigment of value for PGVB2 in the TCC_PATTB register */
#define TCC_PATTB_PGVB3_Pos                   _UINT16_(11)                                         /* (TCC_PATTB) Pattern Generator 3 Output Enable Position */
#define TCC_PATTB_PGVB3_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGVB3_Pos)               /* (TCC_PATTB) Pattern Generator 3 Output Enable Mask */
#define TCC_PATTB_PGVB3(value)                (TCC_PATTB_PGVB3_Msk & (_UINT16_(value) << TCC_PATTB_PGVB3_Pos)) /* Assigment of value for PGVB3 in the TCC_PATTB register */
#define TCC_PATTB_PGVB4_Pos                   _UINT16_(12)                                         /* (TCC_PATTB) Pattern Generator 4 Output Enable Position */
#define TCC_PATTB_PGVB4_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGVB4_Pos)               /* (TCC_PATTB) Pattern Generator 4 Output Enable Mask */
#define TCC_PATTB_PGVB4(value)                (TCC_PATTB_PGVB4_Msk & (_UINT16_(value) << TCC_PATTB_PGVB4_Pos)) /* Assigment of value for PGVB4 in the TCC_PATTB register */
#define TCC_PATTB_PGVB5_Pos                   _UINT16_(13)                                         /* (TCC_PATTB) Pattern Generator 5 Output Enable Position */
#define TCC_PATTB_PGVB5_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGVB5_Pos)               /* (TCC_PATTB) Pattern Generator 5 Output Enable Mask */
#define TCC_PATTB_PGVB5(value)                (TCC_PATTB_PGVB5_Msk & (_UINT16_(value) << TCC_PATTB_PGVB5_Pos)) /* Assigment of value for PGVB5 in the TCC_PATTB register */
#define TCC_PATTB_PGVB6_Pos                   _UINT16_(14)                                         /* (TCC_PATTB) Pattern Generator 6 Output Enable Position */
#define TCC_PATTB_PGVB6_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGVB6_Pos)               /* (TCC_PATTB) Pattern Generator 6 Output Enable Mask */
#define TCC_PATTB_PGVB6(value)                (TCC_PATTB_PGVB6_Msk & (_UINT16_(value) << TCC_PATTB_PGVB6_Pos)) /* Assigment of value for PGVB6 in the TCC_PATTB register */
#define TCC_PATTB_PGVB7_Pos                   _UINT16_(15)                                         /* (TCC_PATTB) Pattern Generator 7 Output Enable Position */
#define TCC_PATTB_PGVB7_Msk                   (_UINT16_(0x1) << TCC_PATTB_PGVB7_Pos)               /* (TCC_PATTB) Pattern Generator 7 Output Enable Mask */
#define TCC_PATTB_PGVB7(value)                (TCC_PATTB_PGVB7_Msk & (_UINT16_(value) << TCC_PATTB_PGVB7_Pos)) /* Assigment of value for PGVB7 in the TCC_PATTB register */
#define TCC_PATTB_Msk                         _UINT16_(0xFFFF)                                     /* (TCC_PATTB) Register Mask  */

#define TCC_PATTB_PGEB_Pos                    _UINT16_(0)                                          /* (TCC_PATTB Position) Pattern Generator x Output Enable Buffer */
#define TCC_PATTB_PGEB_Msk                    (_UINT16_(0xFF) << TCC_PATTB_PGEB_Pos)               /* (TCC_PATTB Mask) PGEB */
#define TCC_PATTB_PGEB(value)                 (TCC_PATTB_PGEB_Msk & (_UINT16_(value) << TCC_PATTB_PGEB_Pos)) 
#define TCC_PATTB_PGVB_Pos                    _UINT16_(8)                                          /* (TCC_PATTB Position) Pattern Generator 7 Output Enable */
#define TCC_PATTB_PGVB_Msk                    (_UINT16_(0xFF) << TCC_PATTB_PGVB_Pos)               /* (TCC_PATTB Mask) PGVB */
#define TCC_PATTB_PGVB(value)                 (TCC_PATTB_PGVB_Msk & (_UINT16_(value) << TCC_PATTB_PGVB_Pos)) 

